Revit 2026 API

# FrameTransform Method

---

Applies the input transform to this frame.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Transform(
	Transform trf
)
```
```vb
Public Sub Transform (
	trf As Transform
)
```
```cpp
public:
void Transform(
	Transform^ trf
)
```
```fsharp
member Transform :
        trf : Transform -> unit
```

#### Parameters

trf Transform
     The transform to apply to the frame.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | this operation failed. |

#### Reference

Frame Class

Autodesk.Revit.DB Namespace